var one =
[
"הצליל המתנה של קופת חולים כללית",
  "השיר הזה",
  "האלבום הזה",
  "ה-tune הזה",
  "האמן הזה",
  "קניה ווסט",
  "הצליל של פתיחת פחית",
  "הקול שאמא שלי עושה כשהיא בשירותים",
  "השיר Macarena",
  "הצליל של הנוטיפיקציות בפייסבוק",
  "הקול של גדעון רייכר",
  "צלצול הטלפון של בר רפאלי",
  "קרקור של תרנגולת",
  "הסרטון שבו יפתח כרמלי מנגן בתוף מרים עם קוסטה קפלן",
  "הפלוץ ששמעתי עכשיו ברכבת",
];

var two =
[
  "מזכיר לי את",
  "נשמע ממש כמו",
  "מדהים אותי בכמה שהוא מזכיר לי את",
  "מעלה לי זכרונות של",
  "חולק נקודות דמיון עם",
];

var three =
[
"המכות שאבא היה מרביץ לי בכל לילה עם החגורה.",
"הפעם הראשונה שהבחור החתיך מהשכבה אמר לי שהוא לא בקטע שלי.",
"הנאום של ביבי באו”ם.",
"הלילות הארוכים שבכיתי בהם בחדר בכל לילה אחרי ששמעתי שלאנה דל ריי ביטלה את ההופעה שלה בארץ בפעם הראשונה. ",
"האומן 17.",
"הלילות הארוכים שבכיתי בהם בחדר בכל לילה אחרי ששמעתי שאייל גולן הולך לבצע שיר של אביב גפן.",
"החיים עצמם.",
"הפוסטים האהובים עליי ב’פי אלף וידויים של פאנק’.",
"יפתח כרמלי.",
"המסך הלבן.",
"התגובה האלמותית על המסך הלבן.",
"השמאלץ.",
"הפלוצים ששומעים ברכבת.",
];

var four =
[
  "איזה עוד שירים מזכירים לכם",
  "איזה עוד אלבומים מעלים בכם מחשבות על",
  "איזה עוד צלילים שאתם מכירים נשמעים כמו",
"איזה עוד אמנים אתם מכירים שמזכירים לכם ",
"איזה עוד דברים ששמעתם אי פעם בחיים מחזירים אתכם אחורה לימים של"];

var five =
[
  "מוות",
  "אהבה",
  "תשוקה",
  "מוות",
  "עולם ומלואו",
  "רגש אמיתי",
  "ניצחון",
  "בכי",
  "ריק מוחלט",
  "חוסר משמעות",
  "התעללות נפשית"
];

function rand(arr){
 return arr[Math.floor(Math.random() * arr.length)];
}

function generateNew(){
$(".description").html(rand(one) +" " + rand(two) +" " + rand(three) +" " + rand(four) +" " + rand(five) +"?");
}

generateNew();

$(".more").click(function(){
  generateNew();
  ga('send','event','pi-elef', 'pi-elef', 'pi-elef-clicked-to-generate-new');
});
